<?php

$table = "";
$table .= "{";

$alphabet = array( "а", "б", "в", "г", "д", "е", "ё", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "я", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "!", "?", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", " ", ".", ",", "(", ")", "{", "}", "\"", ":", ";", "_", "\\", "+", "-", "=", "*", "/", "<", ">", "[", "]", "@", "#", "$", "%", "^", "&", "№", "`", "~" );

$first = random_int(1, 9999);
$second = random_int(1, 9999);
$salt = $first * $second;

foreach ( $alphabet as $letter )
{
    $table .= '"'.$letter.'": "'.hash('adler32', $letter.$salt).'", ';
}

$table = rtrim($table,", ");

$table = str_replace( '"\"', '"\\\"', $table );
$table = str_replace( '"""', '"\""', $table );

$table .= "}";

?>